DELETE FROM votes;
DELETE FROM menu;
DELETE FROM dishes;
DELETE FROM restaurants;
DELETE FROM user_roles;
DELETE FROM users;
ALTER SEQUENCE GLOBAL_SEQ RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001),
       ('USER', 100001);


INSERT INTO restaurants (name)
VALUES ('Ресторан'),  --100002
       ('Ресторан1'), --100003
       ('Ресторан2'), --100004
       ('Ресторан3'), --100005
       ('Ресторан4'); --100006

INSERT INTO dishes (name, price)
VALUES ('olivye', 300), -- 100007
       ('shuba', 200), -- 100008
       ('holodec', 500), -- 100009
       ('zalivnoe', 400), -- 100010
       ('pilemeni', 500), -- 100011
       ('shashlik iz baranini', 1000), -- 100012
       ('shashlik iz kuritsi', 500), -- 100013
       ('shashlik iz svinini', 700), -- 100014
       ('sandwich', 200); -- 100015

INSERT INTO menu (date_time, dish_id, restaurant_id)
       VALUES ('2020-12-30 08:00:00', 100007, 100002), --100016
              ('2020-12-30 08:00:00', 100008, 100002), --100017
              ('2020-12-30 08:00:00', 100009, 100002), --100018

              ('2020-12-30 08:00:00', 100008, 100003), --100019
              ('2020-12-30 08:00:00', 100009, 100003), --100020
              ('2020-12-30 08:00:00', 100010, 100003), --100021

              ('2020-12-31 08:00:00', 100011, 100004), --100022
              ('2020-12-31 08:00:00', 100012, 100004), --100023
              ('2020-12-31 08:00:00', 100013, 100004), --100024

              ('2020-12-31 08:00:00', 100007, 100005), --100025
              ('2020-12-31 08:00:00', 100012, 100005), --100026
              ('2020-12-31 08:00:00', 100010, 100005), --100027

              ('2021-01-11 08:00:00', 100012, 100006), --100028
              ('2021-01-11 08:00:00', 100008, 100006); --100029


INSERT INTO votes (date_time, user_id, restaurant_id)
VALUES ('2020-12-30 09:00:00', 100000, 100002), --100030
       ('2020-12-30 12:00:00', 100000, 100002), --100031
       ('2020-12-31 11:30:00', 100000, 100005), --100032
       ('2020-12-31 10:00:00', 100001, 100005), --100033
       ('2021-01-11 13:00:00', 100001, 100006), --100034
       ('2021-01-11 14:00:00', 100001, 100006); --100035